muban.海螺3.二级.title = '.hl-dc-title&&Text;.hl-data-xs&&Text';
muban.海螺3.二级.desc = 'li.hl-col-xs-12:eq(1)&&Text;;;li.hl-col-xs-12--em:eq(2)&&Text;li.hl-col-xs-12--em:eq(3)&&Text';
var rule={
    title:'飞兔影视',
    host:'https://www.feitu.tv',
    模板:'海螺3',
    // url:'/filter/fyclass/page/fypage/',
	url:'/filter/fyfilter/',
	filterable:1,//是否启用分类筛选,
	filter_url:'{{fl.cateId}}{{fl.area}}{{fl.by}}/page/fypage{{fl.year}}',
    filter: {
                "1":[{"key":"cateId","name":"分類","value":[{"n":"全部","v":"1"},{"n":"冒險","v":"20"},{"n":"劇情","v":"11"},{"n":"动作","v":"6"},{"n":"科幻","v":"9"},{"n":"动画电影","v":"21"},{"n":"喜劇","v":"7"},{"n":"愛情","v":"8"},{"n":"戰爭","v":"12"},{"n":"恐怖","v":"10"},{"n":"犯罪","v":"28"},{"n":"驚悚","v":"25"},{"n":"經典","v":"29"},{"n":"懸疑","v":"24"},{"n":"奇幻","v":"23"},{"n":"同性","v":"22"},{"n":"災難","v":"27"},{"n":"網路電影","v":"30"},{"n":"歌舞","v":"26"}]},{"key":"area","name":"地區","value":[{"n":"全部","v":""},{"n":"大陸","v":"/area/大陆"},{"n":"歐美","v":"/area/欧美"},{"n":"日本","v":"/area/日本"},{"n":"韓國","v":"/area/韩国"},{"n":"香港","v":"/area/香港"},{"n":"臺灣","v":"/area/台湾"},{"n":"泰國","v":"/area/泰国"},{"n":"新馬","v":"/area/新马"},{"n":"其它","v":"/area/其它"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2023","v":"/year/2023"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"}]},{"key":"by","name":"排序","value":[{"n":"時間","v":"/by/time"},{"n":"人氣","v":"/by/hits"},{"n":"評分","v":"/by/score"}]}],
                "2":[{"key":"cateId","name":"分類","value":[{"n":"全部","v":"2"},{"n":"國產劇","v":"13"},{"n":"歐美劇劇","v":"16"},{"n":"港劇","v":"14"},{"n":"日劇","v":"15"},{"n":"韓劇","v":"31"},{"n":"台劇","v":"33"},{"n":"泰劇","v":"32"},{"n":"新馬劇","v":"34"},{"n":"其它劇","v":"35"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2023","v":"/year/2023"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"}]},{"key":"by","name":"排序","value":[{"n":"時間","v":"/by/time"},{"n":"人氣","v":"/by/hits"},{"n":"評分","v":"/by/score"}]}],
                "3":[{"key":"cateId","name":"分類","value":[{"n":"全部","v":"3"},{"n":"國產綜藝","v":"39"},{"n":"韓國綜藝","v":"38"},{"n":"歐美綜藝","v":"36"},{"n":"日本綜藝","v":"37"},{"n":"港台綜藝","v":"41"},{"n":"其它綜藝","v":"42"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2023","v":"/year/2023"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"}]},{"key":"by","name":"排序","value":[{"n":"時間","v":"/by/time"},{"n":"人氣","v":"/by/hits"},{"n":"評分","v":"/by/score"}]}],
                "4":[{"key":"cateId","name":"分類","value":[{"n":"全部","v":"4"},{"n":"歐美動漫","v":"43"},{"n":"日本動漫","v":"44"},{"n":"國產動漫","v":"45"},{"n":"港台動漫","v":"48"},{"n":"韓國動漫","v":"46"},{"n":"其它動漫","v":"49"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2023","v":"/year/2023"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"}]},{"key":"by","name":"排序","value":[{"n":"時間","v":"/by/time"},{"n":"人氣","v":"/by/hits"},{"n":"評分","v":"/by/score"}]}],
               "50":[{"key":"area","name":"地區","value":[{"n":"全部","v":"50"},{"n":"大陸","v":"/area/大陆"},{"n":"歐美","v":"/area/欧美"},{"n":"日本","v":"/area/日本"},{"n":"韓國","v":"/area/韩国"},{"n":"香港","v":"/area/香港"},{"n":"臺灣","v":"/area/台湾"},{"n":"泰國","v":"/area/泰国"},{"n":"新馬","v":"/area/新马"},{"n":"其它","v":"/area/其它"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2023","v":"/year/2023"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"}]},{"key":"by","name":"排序","value":[{"n":"時間","v":"/by/time"},{"n":"人氣","v":"/by/hits"},{"n":"評分","v":"/by/score"}]}],
               "51":[{"key":"area","name":"地區","value":[{"n":"全部","v":"51"},{"n":"大陸","v":"/area/大陆"},{"n":"歐美","v":"/area/欧美"},{"n":"日本","v":"/area/日本"},{"n":"韓國","v":"/area/韩国"},{"n":"香港","v":"/area/香港"},{"n":"臺灣","v":"/area/台湾"},{"n":"泰國","v":"/area/泰国"},{"n":"新馬","v":"/area/新马"},{"n":"其它","v":"/area/其它"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2023","v":"/year/2023"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"}]},{"key":"by","name":"排序","value":[{"n":"時間","v":"/by/time"},{"n":"人氣","v":"/by/hits"},{"n":"評分","v":"/by/score"}]}],
               //"52":[{"key":"cateId","name":"分類","value":[{"n":"全部","v":"52"},{"n":"國產情色","v":"53"},{"n":"日本無碼","v":"54"},{"n":"日本有碼","v":"55"},{"n":"中文字幕","v":"56"},{"n":"歐美極品","v":"57"},{"n":"動漫精品","v":"58"},{"n":"情色亂倫","v":"59"},{"n":"變態另類","v":"60"},{"n":"國產主播","v":"61"},{"n":"巨乳美乳","v":"62"},{"n":"制服誘惑","v":"63"},{"n":"熟女人妻","v":"64"},{"n":"三级倫理","v":"65"},{"n":"自拍偷拍","v":"66"},{"n":"AI換臉","v":"67"},{"n":"海外明星","v":"68"},{"n":"福利視頻","v":"69"},{"n":"萌妹蘿莉","v":"70"},{"n":"女同","v":"72"},{"n":"人妖系列","v":"73"},{"n":"AV解說","v":"90"},{"n":"國產傳媒","v":"100"},{"n":"韓國主播","v":"101"},{"n":"VR視角","v":"102"},{"n":"網爆黑料","v":"103"},{"n":"島國群交","v":"104"},{"n":"島國素人","v":"105"},{"n":"口爆顏射","v":"106"},{"n":"探花系列","v":"107"}]},{"key":"by","name":"排序","value":[{"n":"時間","v":"/by/time"},{"n":"人氣","v":"/by/hits"},{"n":"評分","v":"/by/score"}]}]
                      },
	filter_def:{
		1:{cateId:'1'},
		2:{cateId:'2'},
		3:{cateId:'3'},
		4:{cateId:'4'},
		52:{cateId:'52'},
		51:{cateId:'51'},
		50:{cateId:'50'}
	},
    searchUrl:'/search/**-fypage/',
    class_name:'電影&電視劇&綜藝&動漫&紀錄片', 
    class_url:'1&2&3&4&51',
    //class_parse: 'body&&.hl-nav li:gt(0);a&&Text;a&&href;.*/(\\d+)/',
    //cate_exclude:'成人影院',
}
