var rule = {
    title: '纽约影院',
    模板:'短视2',
    host: 'https://www.nycvod.com',
	url: '/index.php/api/vod#type=fyfilter&page=fypage',
	filterable:1,//是否启用分类筛选,
	filter_url:'{{fl.cateId}}',
	filter: {
        "1":[{"key":"cateId","name":"分類","value":[{"n":"全部","v":"1"},{"n":"動作片","v":"9"},{"n":"喜劇片","v":"10"},{"n":"奇幻片","v":"11"},{"n":"科幻片","v":"12"},{"n":"恐怖片","v":"22"},{"n":"驚悚片","v":"27"},{"n":"懸疑片","v":"23"},{"n":"愛情片","v":"21"},{"n":"戰爭片","v":"20"},{"n":"劇情片","v":"6"},{"n":"網路電影","v":"24"},{"n":"犯罪片","v":"26"},{"n":"災難片","v":"7"},{"n":"動畫電影","v":"25"},{"n":"冒險片","v":"28"},{"n":"同性片","v":"44"},{"n":"紀錄片","v":"29"},{"n":"歌舞片","v":"45"},{"n":"經典片","v":"46"},{"n":"🔞倫理片","v":"8"}]}],
        "2":[{"key":"cateId","name":"分類","value":[{"n":"全部","v":"2"},{"n":"國產劇","v":"30"},{"n":"歐美劇","v":"47"},{"n":"日韓劇","v":"18"},{"n":"港台劇","v":"16"},{"n":"新馬泰劇","v":"14"},{"n":"其他劇","v":"13"}]}],
        "3":[{"key":"cateId","name":"分類","value":[{"n":"全部","v":"3"},{"n":"國產綜藝","v":"31"},{"n":"日韓綜藝","v":"32"},{"n":"歐美綜藝","v":"34"},{"n":"港台綜藝","v":"35"},{"n":"其他綜藝","v":"37"}]}],
        "4":[{"key":"cateId","name":"分類","value":[{"n":"全部","v":"4"},{"n":"日韓動漫","v":"38"},{"n":"國產動漫","v":"39"},{"n":"歐美動漫","v":"40"},{"n":"港台動漫","v":"42"},{"n":"其他動漫","v":"43"}]}]
        },
	filter_def:{
		1:{cateId:'1'},
		2:{cateId:'2'},
		3:{cateId:'3'},
		4:{cateId:'4'},
        5:{cateId:'5'}
	},
    class_name:'電影&電視劇&綜藝&動漫',
    class_url:'1&2&3&4&5',
    detailUrl:'/voddetail/fyid.html',
}
