/*發布頁: https://www.ysgcapp.cc */
var rule = {
    title: '影視工廠',
    host: 'https://www.ysgc.fun',
    //host:'https://www.ysgcapp.cc',
    //hostJs:'print(HOST);let html=request(HOST,{headers:{"User-Agent":PC_UA}});let src=jsp.pdfh(html,".section-row:eq(1)&&a&&href");print(src);HOST=src',
    url: '/vodshow/fyfilter.html',
    headers: {'User-Agent': 'PC_UA','Accept': 'text/html'},
    //searchUrl: '/index.php/rss/index.xml?wd=**',
    searchUrl:'/vodsearch/**----------fypage---.html',
    searchable: 1, //是否启用全局搜索,
    quickSearch: 1, //是否启用快速搜索,
    filterable: 1, //是否启用分类筛选,
    filter_url: '{{fl.cateId}}-{{fl.area}}-{{fl.by}}-{{fl.class}}-----fypage---{{fl.year}}',
    filter: {
           "1":[{"key":"class","name":"類型","value":[{"n":"全部","v":""},{"n":"動作","v":"动作"},{"n":"喜劇","v":"喜剧"},{"n":"愛情","v":"爱情"},{"n":"科幻","v":"科幻"},{"n":"恐怖","v":"恐怖"},{"n":"懸疑","v":"悬疑"},{"n":"劇情","v":"剧情"},{"n":"戰爭","v":"战争"},{"n":"紀錄","v":"纪录"},{"n":"Netfix","v":"Netfix"}]},
           	   {"key":"area","name":"地區","value":[{"n":"全部","v":""},{"n":"中國","v":"中国大陆"},{"n":"香港","v":"中国香港"},{"n":"台灣","v":"中国台湾"},{"n":"日本","v":"日本"},{"n":"韓國","v":"韩国"},{"n":"泰國","v":"泰国"},{"n":"美國","v":"美国"}]},
           	   {"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"即將上線","v":"即将上线"},{"n":"2025","v":"2025"},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"},{"n":"2009","v":"2009"},{"n":"2008","v":"2008"},{"n":"2007","v":"2007"},{"n":"2006","v":"2006"},{"n":"2005","v":"2005"},{"n":"2004","v":"2004"},{"n":"2003","v":"2003"},{"n":"2002","v":"2002"},{"n":"2001","v":"2001"},{"n":"2000","v":"2000"}]},
           	   {"key":"by","name":"排序","value":[{"n":"最新","v":"time"},{"n":"最熱","v":"hits_week"},{"n":"高分","v":"score"}]}],
           "2":[{"key":"class","name":"類型","value":[{"n":"全部","v":""},{"n":"愛情","v":"爱情"},{"n":"古裝","v":"古装"},{"n":"懸疑","v":"悬疑"},{"n":"驚悚","v":"惊悚"},{"n":"恐怖","v":"恐怖"},{"n":"劇情","v":"剧情"},{"n":"都市","v":"都市"},{"n":"偶像","v":"偶像"},{"n":"家庭","v":"家庭"},{"n":"武俠","v":"武侠"},{"n":"科幻","v":"科幻"},{"n":"網劇","v":"网剧"},{"n":"言情","v":"言情"},{"n":"諜戰","v":"谍战"},{"n":"軍旅","v":"军旅"}]},
           	   {"key":"area","name":"地區","value":[{"n":"全部","v":""},{"n":"中國","v":"中国大陆"},{"n":"香港","v":"中国香港"},{"n":"台灣","v":"中国台湾"},{"n":"日本","v":"日本"},{"n":"韓國","v":"韩国"},{"n":"泰國","v":"泰国"},{"n":"美國","v":"美国"},{"n":"英國","v":"英国"}]},
           	   {"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"即將上線","v":"即将上线"},{"n":"2025","v":"2025"},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"},{"n":"2009","v":"2009"},{"n":"2008","v":"2008"},{"n":"2006","v":"2006"},{"n":"2005","v":"2005"},{"n":"2004","v":"2004"},{"n":"2003","v":"2003"},{"n":"2002","v":"2002"},{"n":"2001","v":"2001"},{"n":"2000","v":"2000"}]},
           	   {"key":"by","name":"排序","value":[{"n":"最新","v":"time"},{"n":"最熱","v":"hits_week"},{"n":"高分","v":"score"}]}],
           "3":[{"key":"class","name":"類型","value":[{"n":"全部","v":""},{"n":"搞笑","v":"搞笑"},{"n":"真人秀","v":"真人秀"},{"n":"美食","v":"美食"},{"n":"選秀","v":"选秀"},{"n":"文化","v":"文化"},{"n":"情感","v":"情感"},{"n":"音樂","v":"音乐"},{"n":"旅遊","v":"旅游"},{"n":"訪談","v":"访谈"},{"n":"脫口秀","v":"脱口秀"}]},
           	   {"key":"area","name":"地區","value":[{"n":"全部","v":""},{"n":"中國","v":"中国大陆"},{"n":"台灣","v":"中国台湾"},{"n":"韓國","v":"韩国"}]},
           	   {"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"即將上線","v":"即将上线"},{"n":"2025","v":"2025"},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"},{"n":"2009","v":"2009"},{"n":"2008","v":"2008"},{"n":"2007","v":"2007"},{"n":"2006","v":"2006"},{"n":"2005","v":"2005"},{"n":"2004","v":"2004"},{"n":"2003","v":"2003"},{"n":"2002","v":"2002"},{"n":"2001","v":"2001"},{"n":"2000","v":"2000"}]},
           	   {"key":"by","name":"排序","value":[{"n":"最新","v":"time"},{"n":"最熱","v":"hits_week"},{"n":"高分","v":"score"}]}],
          "4":[{"key":"class","name":"類型","value":[{"n":"全部","v":""},{"n":"科幻","v":"科幻"},{"n":"熱血","v":"热血"},{"n":"科幻","v":"科幻"},{"n":"搞笑","v":"搞笑"},{"n":"冒險","v":"冒险"},{"n":"戀愛","v":"恋爱"},{"n":"校園","v":"校园"},{"n":"勵志","v":"励志"},{"n":"奇幻","v":"奇幻"},{"n":"漫畫改編","v":"漫画改编"},{"n":"少年","v":"少年"}]},
           	   {"key":"area","name":"地區","value":[{"n":"全部","v":""},{"n":"中國","v":"中国大陆"},{"n":"日本","v":"日本"}]},
           	   {"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"即將上線","v":"即将上线"},{"n":"2025","v":"2025"},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"},{"n":"2009","v":"2009"},{"n":"2008","v":"2008"},{"n":"2007","v":"2007"},{"n":"2006","v":"2006"},{"n":"2005","v":"2005"},{"n":"2004","v":"2004"},{"n":"2003","v":"2003"},{"n":"2002","v":"2002"},{"n":"2001","v":"2001"},{"n":"2000","v":"2000"}]},
           	   {"key":"by","name":"排序","value":[{"n":"最新","v":"time"},{"n":"最熱","v":"hits_week"},{"n":"高分","v":"score"}]}],
          "24":[{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2025","v":"2025"},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"},{"n":"2009","v":"2009"},{"n":"2008","v":"2008"},{"n":"2007","v":"2007"},{"n":"2006","v":"2006"},{"n":"2005","v":"2005"},{"n":"2004","v":"2004"},{"n":"2003","v":"2003"},{"n":"2002","v":"2002"},{"n":"2001","v":"2001"},{"n":"2000","v":"2000"}]},
           	   {"key":"by","name":"排序","value":[{"n":"最新","v":"time"},{"n":"最熱","v":"hits_week"},{"n":"高分","v":"score"}]}],
          "33":[{"key":"class","name":"類型","value":[{"n":"全部","v":""},{"n":"女頻戀愛","v":"女频恋爱"},{"n":"反轉爽劇","v":"反转爽剧"},{"n":"腦洞懸疑","v":"脑洞悬疑"},{"n":"年代穿越","v":"年代穿越"},{"n":"古裝仙俠","v":"古装仙侠"},{"n":"現代都市","v":"现代都市"}]},
           	   {"key":"area","name":"地區","value":[{"n":"全部","v":""},{"n":"中國","v":"中国大陆"}]},
           	   {"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2025","v":"2025"},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"},{"n":"2009","v":"2009"},{"n":"2008","v":"2008"},{"n":"2007","v":"2007"},{"n":"2006","v":"2006"},{"n":"2005","v":"2005"},{"n":"2004","v":"2004"},{"n":"2003","v":"2003"},{"n":"2002","v":"2002"},{"n":"2001","v":"2001"},{"n":"2000","v":"2000"}]},
           	   {"key":"by","name":"排序","value":[{"n":"最新","v":"time"},{"n":"最熱","v":"hits_week"},{"n":"高分","v":"score"}]}]
           	   
          },
        filter_def:{
		          1:{cateId:'1'},
		          2:{cateId:'2'},
		          3:{cateId:'3'},
	                  4:{cateId:'4'},
	                24:{cateId:'24'},
	                33:{cateId:'33'},
	                },
    class_name: '電影&電視劇&綜藝&動漫&紀錄片&短劇',
    class_url: '1&2&3&4&24&33',
    play_parse: true,
    lazy:"js:var html=JSON.parse(request(input).match(/r player_.*?=(.*?)</)[1]);log(html);var url=html.url;if(html.encrypt=='1'){url=unescape(url).split('&')[0]}else if(html.encrypt=='2'){url=unescape(base64Decode(url).split('&')[0])}if(/m3u8|mp4/.test(url)){input=url}else{input}",
    limit: 6,
    推荐: 'div.hide-b-16;.public-pic-b;a&&title;;;a&&href',
    double: true, // 推荐内容是否双层定位
    一级: 'div.fadeInUp .public-list-box .public-list-bj;a&&title;;.public-list-prb&&Text;a&&href',
    二级: {
        "title": ".this-desc-title&&Text;.focus-item-label-original&&Text",
        "img": ".this-pic-bj&&url",
        "desc": ";.this-tag this-b--i&&Text;;.this-info:eq(1)--strong&&Text;.this-info:eq(0)--strong&&Text",
        "content": ".this-desc--strong&&Text",
        "tabs": ".nav-swiper .swiper-wrapper&&a",
        "lists": ".anthology-list-box:eq(#id)&&li"
    },
    detailUrl:'/voddetail/fyid.html', //非必填,二级详情拼接链接
    搜索: 'div.border-box .public-list-box .public-list-bj;a&&title;;.public-list-prb&&Text;a&&href',
	//是否启用辅助嗅探: 1,0
	sniffer:1,
	// 辅助嗅探规则js写法
	isVideo:`js:
		log(input);
		if (/m3u8\\?sign=/.test(input)) {
			input = true
		} else if (/index\\.m3u8/.test(input)) {
			input = true
		} else {
			input = false
		}
	`,
}
